var app = angular.module('appKI', ['ngRoute', 'ngSanitize', 'pascalprecht.translate'])
  .config( ['$routeProvider', '$locationProvider', '$translateProvider', function($routeProvider, $locationProvider, $translateProvider) {
  $routeProvider
  .when('/ki/', {
    templateUrl: 'templates/main.html'
  })
  .when ('/ki/history', {
      templateUrl: 'templates/history.html'
  })
  .when ('/ki/professors', {
      templateUrl: 'templates/professors.html'
  })
  .when ('/ki/science', {
      templateUrl: 'templates/science.html'
  })
  .when ('/ki/contacts', {
      templateUrl: 'templates/contacts.html'
  })





  $translateProvider.translations('uk', {
    // HEADERS

    'TITLE': 'Факультет комп\'ютерних наук і технологій',
    'HISTORY': 'Історія',
    'DIRECTION': 'Напрямки',
    'SCIENCE': 'Наука та співробітництво',
    'PROFESSORS': 'Викладачі',
    'CONTACTS': 'Контакти',
    'UNIVERSITY_SHORT': 'ДонНТУ',
    'FACULTY_SHORT': 'ФКНТ',
    'DEPARTMENT': 'Кафедра комп\'ютерної інженерії',

    // FOOTER

    'INTEREST': 'Зацікавлені у співробітництві?',
    'FOOTER_CONTACT': 'Зв\'яжіться з нами',



    // MAIN PAGE    
    'CAF': 'Кафедра',
    'CAF1': 'комп\'ютерної',
    'CAF2': 'інженерії',
    'ABOUT_CAF': 'Про кафедру',
    'ABOUT_CAF1': 'Кафедра &quot;Комп\'ютерна інженерія&quot; готує професіоналів найвищого рівня у різноманітних галузях народного господарства. Знання фахівців з комп\'ютерних систем та мереж дозволяють працювати як в якості фахового, так і системного програміста, самостійно розробляти системне та прикладне математичне забезпечення, зокрема розробляти драйвери, утиліти користувача, елементи операційних систем, компіляторів, комп\'ютерну інтерактивну графіку, системи автоматизованого проектування, системи штучного інтелекту, вбудовані програми для спеціалізованих обчислювальних систем.',
    'ABOUT_CAF2': 'Фахівець з комп\'ютерних систем та мереж перш за все орієнтований на діяльність в організаціях, підприємствах та установах, що використовують комп’ютерну техніку, в обчислювальних та інформаційно-обчислювальних центрах і комп\'ютерних підрозділах підприємств і організацій всіх галузей народного господарства. В цих умовах актуальною є потреба підготовки висококваліфікованих спеціалістів в галузі комп\'ютерних систем та мереж.',
    'CAF_TITLE': 'Основні напрямки наукових досліджень і підготовки спеціалістів',

    //MAIN
    'caf_item_1': 'Архітектура сучасних комп\'ютерів. Схемотехніка',
    'caf_item_1_title': 'Мікропроцесори та мікроконтролери',
    'caf_item_2': 'Застосування MPI та OpenMP. Суперкомп\'ютери та паралельне програмування. Кафедра активно співпрацює з HLRS (Штутгарт), де функціонує суперкомп\'ютер Hazel Hen, що входить у першу десятку Top500 суперкомп\'ютерів',
    'caf_item_2_title': 'Паралельне програмування',
    'caf_item_3': 'Проектування комп\'ютерних мереж і створення програмного забезпечення для їх роботи',
    'caf_item_3_title': 'Комп\'ютерні мережі',
    'caf_item_4': 'Обробка аудіосигналів, в тому числі й мови, обробка зображень, розпізнавання образів, зниження шумів і фільтрація',
    'caf_item_4_title': 'Обробка цифрових сигналів',
    'caf_item_5': 'Операційні системи і системи реального часу. Створення системного програмного забезпечення',
    'caf_item_5_title': 'Системне програмування',
    'caf_item_6': 'Системи штучного інтелекту на основі нечіткої логіки та нейронних мереж',
    'caf_item_6_title': 'Штучний інтелект',
    'caf_item_7': 'Програмування на Java. Програмування мобільних додатків для ОС Android',
    'caf_item_7_title': 'Мобільні додатки',
    'caf_item_8': 'Для досліджень в лабораторії кафедри є 3D-принтер Creator Pro',
    'caf_item_8_title': 'Адитивні технології',
    'caf_item_9': 'Створення інтелектуальних мобільних роботів на базі Arduino та Raspberry Pi',
    'caf_item_9_title': 'Робототехніка',

    //CONTACTS

    'ADR_TITLE': 'Адреса',
    'ADR': 'м. Покровськ, пл. Шибанкова, 2',
    'REGYME_TITLE': 'Режим роботи підрозділів університету',
    'REGYME': ' з 8:00 по 16:30',
    'WHEREWEARE': 'Де нас знайти',
    'BUILDING': '3й корпус, ауд. 1',   


    //PROFESSORS
    'svyatniy': 'Святний Володимир Андрійович',
    'caf_head': 'Завідувач кафедри',
    'dtn': 'Доктор технічних наук, професор',

    'docent': 'Доцент кафедри',
    'dac': 'Кандидат технічних наук, доцент',
    'sv': 'Старший викладач кафедри',
    'eng': 'Провідний інженер кафедри',
    'lh': 'Старший лаборант кафедри',
    'lab': 'Лаборант кафедри',

    'p1': 'Ковальов Сергій Олександрович',
    'p2': 'Шамаєв Віталій Віталійович',
    'p3': 'Цололо Сергій Олексійович',
    'p4': 'Мірошкін Олександр Миколайович',
    'p5': 'Самощенко Олександр Вікторович',
    'p6': 'Шевченко Ольга Георгіївна',
    'p7': 'Дікова Юлія Леонідівна',
    'p8': 'Бардаков Сергій Миколайович',
    'p9': 'Крюковська Олена Вячеславівна',
    'p10': 'Сорока Маргарита Олегівна',
    

    

  });
 
  $translateProvider.translations('ru', {

    // HEADERS

    'TITLE': 'Факультет компьютерных наук и технологий',
    'HISTORY': 'История',
    'DIRECTION': 'Направления',
    'SCIENCE': 'Наука и сотрудничество',
    'PROFESSORS': 'Преподаватели',
    'CONTACTS': 'Контакты',
    'UNIVERSITY_SHORT': 'ДонНТУ',
    'FACULTY_SHORT': 'ФКНТ',
    'DEPARTMENT': 'Кафедра компьютерной инженерии',

    // FOOTER

    'INTEREST': 'Заинтересованы в сотрудничестве?',
    'FOOTER_CONTACT': 'Свяжитесь с нами',

    'CAF': 'Кафедра',
    'CAF1': 'компьютерной',
    'CAF2': 'инженерии',
    'ABOUT_CAF': 'Про кафедру',
    'ABOUT_CAF1': 'Кафедра &quot;Компьютерная инженерия&quot; готовит профессионалов высокого уровня в различных областях народного хозяйства. Знания специалистов компьютерных систем и сетей позволяют работать как в качестве профессионального, так и системного программиста, самостоятельно разрабатывать системное и прикладное математическое обеспечение, в том числе разрабатывать драйверы, утилиты пользователя, элементы операционных систем, компиляторов, компьютерную интерактивную графику, системы автоматизированного проектирования, системы искусственного интеллекта, встроенные программы для специализированных вычислительных систем.',
    'ABOUT_CAF2': 'Специалист по компьютерным системам и сетям прежде всего ориентирован на деятельность в организациях, предприятиях и учреждениях, использующих компьютерную технику, в вычислительных и информационно-вычислительных центрах и компьютерных подразделениях предприятий и организаций всех отраслей народного хозяйства. В этих условиях актуальной является потребность подготовки высококвалифицированных специалистов в области компьютерных систем и сетей.',
    'CAF_TITLE': 'Основные направления научных исследований и подготовки специалистов',

    //MAIN

    'caf_item_1': 'Архитектура современных компьютеров. схемотехника',
    'caf_item_1_title': 'Микропроцессоры и микроконтроллеры',
    'caf_item_2': 'Применение MPI и OpenMP. Суперкомпьютеры и параллельное программирование. Кафедра активно сотрудничает с HLRS (Штутгарт), где функционирует суперкомпьютер Hazel Hen, что входит в первую десятку Top500 суперкомпьютеров',
    'caf_item_2_title': 'Параллельное программирование',
    'caf_item_3': 'Проектирование компьютерных сетей и создание программного обеспечения для их работы',
    'caf_item_3_title': 'Компьютерные сети',
    'caf_item_4': 'Обработка аудиосигналов, в том числе и речи, обработка изображений, распознавание образов, снижение шумов и фильтрация',
    'caf_item_4_title': 'Обработка цифровых сигналов',
    'caf_item_5': 'Операционные системы и системы реального времени. Создание системного программного обеспечения',
    'caf_item_5_title': 'Системное программирование',
    'caf_item_6': 'Системы искусственного интеллекта на основе нечеткой логики и нейронных сетей',
    'caf_item_6_title': 'Искусственный интеллект',
    'caf_item_7': 'Программирование на Java. Программирование мобильных приложений для ОС Android',
    'caf_item_7_title': 'Мобильные приложения',
    'caf_item_8': 'Для исследований в лаборатории кафедры есть 3D-принтер Creator Pro',
    'caf_item_8_title': 'Аддитивные технологии',
    'caf_item_9': 'Создание интеллектуальных мобильных роботов на базе Arduino и Raspberry Pi',
    'caf_item_9_title': 'Робототехника',

    //CONTACTS

    'ADR_TITLE': 'Адрес',
    'ADR': 'г. Покровск, пл. Шибанкова, 2',
    'REGYME_TITLE': 'Режим работы подразделений университета',
    'REGYME': ' с 8:00 по 16:30',
    'WHEREWEARE': 'Где нас найти',
    'BUILDING': '3й корпус, ауд. 1',    


    //PROFESSORS
    'svyatniy': 'Святный Владимир Андреевич',
    'caf_head': 'Заведующий кафедрой',
    'dtn': 'Доктор технических наук, профессор',

    'docent': 'Доцент кафедры',
    'dac': 'Кандидат технических наук, доцент',
    'sv': 'Старший преподаватель кафедры',
    'eng': 'Ведущий инженер кафедры',
    'lh': 'Старший лаборант кафедры',
    'lab': 'Лаборант кафедры',

    'p1': 'Ковалёв Сергей Александрович',
    'p2': 'Шамаев Виталий Виталиевич',
    'p3': 'Цололо Сергей Васильевич :)',
    'p4': 'Мирошкин Александр Николаевич',
    'p5': 'Самощенко Александр Викторович',
    'p6': 'Шевченко Ольга Георгиевна',
    'p7': 'Дикова Юлия Леонидовна',
    'p8': 'Бардаков Сергей Николаевич',
    'p9': 'Крюковская Елена Вячеславовна',
    'p10': 'Сорока Маргарита Олеговна',
  });

$translateProvider.translations('en', {

    // HEADERS

    'TITLE': 'Faculty of Computer Sciences and Technologies',
    'HISTORY': 'History',
    'DIRECTION': 'Направления',
    'SCIENCE': 'Наука и сотрудничество',
    'PROFESSORS': 'Professors',
    'CONTACTS': 'Contacts',
    'UNIVERSITY_SHORT': 'DNTU',
    'FACULTY_SHORT': 'ФКНТ',
    'DEPARTMENT': 'Кафедра комп\'ютерної інженерії',

    // FOOTER

    'INTEREST': 'Заинтересованы в сотрудничестве?',
    'FOOTER_CONTACT': 'Contact us',

    // MAIN
    'caf_item_1': 'Архитектура современных компьютеров. схемотехника',
    'caf_item_1_title': 'Микропроцессоры и микроконтроллеры',
    'caf_item_2': 'Применение MPI и OpenMP. Суперкомпьютеры и параллельное программирование. Кафедра активно сотрудничает с HLRS (Штутгарт), где функционирует суперкомпьютер Hazel Hen, что входит в первую десятку Top500 суперкомпьютеров',
    'caf_item_2_title': 'Параллельное программирование',
    'caf_item_3': 'Проектирование компьютерных сетей и создание программного обеспечения для их работы',
    'caf_item_3_title': 'Компьютерные сети',
    'caf_item_4': 'Обработка аудиосигналов, в том числе и речи, обработка изображений, распознавание образов, снижение шумов и фильтрация',
    'caf_item_4_title': 'Обработка цифровых сигналов',
    'caf_item_5': 'Операционные системы и системы реального времени. Создание системного программного обеспечения',
    'caf_item_5_title': 'Системное программирование',
    'caf_item_6': 'Системы искусственного интеллекта на основе нечеткой логики и нейронных сетей',
    'caf_item_6_title': 'Искусственный интеллект',
    'caf_item_7': 'Программирование на Java. Программирование мобильных приложений для ОС Android',
    'caf_item_7_title': 'Мобильные приложения',
    'caf_item_8': 'Для исследований в лаборатории кафедры есть 3D-принтер Creator Pro',
    'caf_item_8_title': 'Аддитивные технологии',
    'caf_item_9': 'Создание интеллектуальных мобильных роботов на базе Arduino и Raspberry Pi',
    'caf_item_9_title': 'Робототехника',

    //
    //CONTACTS

    'ADR_TITLE': 'Address',
    'ADR': 'м. Покровськ, пл. Шибанкова, 2',
    'REGYME_TITLE': 'Режим роботи підрозділів університету',
    'REGYME': ' from 8:00 to 16:30',
    'WHEREWEARE': 'Where we are',
    'BUILDING': '3й корпус, ауд. 1',   

    //PROFESSORS
    'svyatniy': 'Святний Володимир Андрійович',
    'caf_head': 'Head of department',
    'dtn': 'Доктор технічних наук, професор',

    'docent': 'Доцент кафедри',
    'dac': 'Кандидат технічних наук, доцент',
    'sv': 'Старший викладач кафедри',
    'eng': 'Провідний інженер кафедри',
    'lh': 'Старший лаборант кафедри',
    'lab': 'Лаборант кафедри',

    'p1': 'Ковальов Сергій Олександрович',
    'p2': 'Шамаєв Віталій Віталійович',
    'p3': 'Цололо Сергій Олексійович',
    'p4': 'Мірошкін Олександр Миколайович',
    'p5': 'Самощенко Олександр Вікторович',
    'p6': 'Шевченко Ольга Георгіївна',
    'p7': 'Дікова Юлія Леонідівна',
    'p8': 'Бардаков Сергій Миколайович',
    'p9': 'Крюковська Олена Вячеславівна',
    'p10': 'Сорока Маргарита Олегівна',




  });

  $translateProvider.preferredLanguage('uk');


    // use the HTML5 History API
    $locationProvider.html5Mode({
          enabled: true,
          requireBase: false
    }); 
}]);

app.run(function($rootScope, $location, $anchorScroll, $translate, $routeParams) {
    console.log('hey');
  //when the route is changed scroll to the proper element.
  $rootScope.$on('$routeChangeSuccess', function(newRoute, oldRoute) {
    
   // if($location.hash()) $anchorScroll();  
  });
  $rootScope.language = 'uk';

  if (localStorage.getItem('ki-path')) {  
    $location.url('/ki/' + localStorage.getItem('ki-path'));
    localStorage.clear('ki-path');
  }
  
  if (sessionStorage.getItem('user')) {
    $rootScope.logged = true;
    $rootScope.user = sessionStorage.getItem('user');
  }
});

  
