<?php

require_once("config/database.php"); 

function execute_query($some_query, $database) {
    // prepare query
    $stmt = $database->prepare($some_query);

    if($stmt->execute()){
        return true;
    }else{
        echo "<pre>";
            print_r($stmt->errorInfo());
        echo "</pre>";
 
        return false;
    }
}
function create_user($data,$db){
	$query = "INSERT INTO 
                " . 'users' . "
            SET 
                username=:username, email=:email, level=:level, password=:password";
    
    // prepare query
    $stmt = $db->prepare($query);

    // posted values
    $username=htmlspecialchars(strip_tags($data['username']));
    $email=htmlspecialchars(strip_tags($data['email']));
    $level=htmlspecialchars(strip_tags($data['level']));
    $password=password_hash(htmlspecialchars(strip_tags($data['password'])), PASSWORD_DEFAULT);
 
    // bind values
    $stmt->bindParam(":username", $username);
    $stmt->bindParam(":email", $email);
    $stmt->bindParam(":level", $level);
    $stmt->bindParam(":password", $password);

    if($stmt->execute()){
        return true;
    }else{
        echo "<pre>";
            print_r($stmt->errorInfo());
        echo "</pre>";
        return false;
    }
}
function create_news($data,$db){
	$query = "INSERT INTO 
                " . 'news' . "
            SET 
                title_uk=:title_uk, title_ru=:title_ru, title_en=:title_en, full_text_uk=:full_text_uk, full_text_ru=:full_text_ru, full_text_en=:full_text_en, short_text_uk=:short_text_uk, short_text_ru=:short_text_ru, short_text_en=:short_text_en, images_nums=:images_nums";
    
    // prepare query
    $stmt = $db->prepare($query);

    // posted values
    $title_uk=htmlspecialchars(strip_tags($data['title_uk']));
    $title_ru=htmlspecialchars(strip_tags($data['title_ru']));
    $title_en=htmlspecialchars(strip_tags($data['title_en']));
    $full_text_uk=htmlspecialchars(strip_tags($data['full_text_uk']));
    $full_text_ru=htmlspecialchars(strip_tags($data['full_text_ru']));
    $full_text_en=htmlspecialchars(strip_tags($data['full_text_en']));
    $short_text_uk=htmlspecialchars(strip_tags($data['short_text_uk']));
    $short_text_ru=htmlspecialchars(strip_tags($data['short_text_ru']));
    $short_text_en=htmlspecialchars(strip_tags($data['short_text_en']));
    $images_nums=htmlspecialchars(strip_tags($data['images_nums']));
 
    // bind values
    $stmt->bindParam(":title_uk", $title_uk);
    $stmt->bindParam(":title_ru", $title_ru);
    $stmt->bindParam(":title_en", $title_en);
    $stmt->bindParam(":full_text_uk", $full_text_uk);
    $stmt->bindParam(":full_text_ru", $full_text_ru);
    $stmt->bindParam(":full_text_en", $full_text_en);
    $stmt->bindParam(":short_text_uk", $short_text_uk);
    $stmt->bindParam(":short_text_ru", $short_text_ru);
    $stmt->bindParam(":short_text_en", $short_text_en);
    $stmt->bindParam(":images_nums", $images_nums);

    if($stmt->execute()){
        return true;
    }else{
        echo "<pre>";
            print_r($stmt->errorInfo());
        echo "</pre>";
        return false;
    }
}

$success = true;
$database = new Database();
$db = $database->getConnection();

$query = "CREATE TABLE IF NOT EXISTS `users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `level` int(10) unsigned NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=1 ;";

if(!execute_query($query,$db)){
	$success = false;
}

if(!create_user(array('username'=>'administrator','email'=>'daniella.brovkina@donntu.edu.ua','level'=>'0','password'=>'fKnT74-AdmiN09'),$db,'users')){
	$success = false;
}

$query = "CREATE TABLE IF NOT EXISTS `news` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title_uk` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `title_ru` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `title_en` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `full_text_uk` text COLLATE utf8_unicode_ci NOT NULL,
  `full_text_ru` text COLLATE utf8_unicode_ci NOT NULL,
  `full_text_en` text COLLATE utf8_unicode_ci NOT NULL,
  `short_text_uk` text COLLATE utf8_unicode_ci NOT NULL,
  `short_text_ru` text COLLATE utf8_unicode_ci NOT NULL,
  `short_text_en` text COLLATE utf8_unicode_ci NOT NULL,
  `images_nums` text COLLATE utf8_unicode_ci NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `modified` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=1;";

if(!execute_query($query,$db)){
	$success = false;
}

if(!create_news(array(
	'title_uk'=>'Участь в олімпіаді з німецької мови',
	'title_ru'=>'Участь в олімпіаді з німецької мови',
	'title_en'=>'Участь в олімпіаді з німецької мови',
	'full_text_uk'=>'<p>В олімпіаді прийняли участь 28 студентів із 14 міст України. Донецький національний технічний університет представила Галина Нещадіна, студентка факультету комп’ютерних наук і технологій.</p><p>12 квітня відбувалися заїзд, реєстрація та поселення учасників: надавалися кімнати у студентських гуртожитках або готелі. Олімпіада проводилась в два етапи: 13 та 14 квітня. В першому етапі в конкурсі взяли участь усі студенти – відбувся письмовий етап. Наступного дня за результатами письмових робіт були визначені фіналісти олімпіади, які в другому етапі змагалися в усній частині. Найбільш обізнані та талановиті посіли призові місця. </p><p>Окрім офіційної частини гості Харкова відвідали Політехнічний музей НТУ «ХПІ» та дізналися багато нового про один з найстаріших технічних вишів України. </p><p>До речі, назва ДонНТУ пролунала під час церемонії нагородження фіналістів олімпіади!</p>',
	'full_text_ru'=>'<p>В олімпіаді прийняли участь 28 студентів із 14 міст України. Донецький національний технічний університет представила Галина Нещадіна, студентка факультету комп’ютерних наук і технологій.</p><p>12 квітня відбувалися заїзд, реєстрація та поселення учасників: надавалися кімнати у студентських гуртожитках або готелі. Олімпіада проводилась в два етапи: 13 та 14 квітня. В першому етапі в конкурсі взяли участь усі студенти – відбувся письмовий етап. Наступного дня за результатами письмових робіт були визначені фіналісти олімпіади, які в другому етапі змагалися в усній частині. Найбільш обізнані та талановиті посіли призові місця. </p><p>Окрім офіційної частини гості Харкова відвідали Політехнічний музей НТУ «ХПІ» та дізналися багато нового про один з найстаріших технічних вишів України. </p><p>До речі, назва ДонНТУ пролунала під час церемонії нагородження фіналістів олімпіади!</p>',
	'full_text_en'=>'<p>В олімпіаді прийняли участь 28 студентів із 14 міст України. Донецький національний технічний університет представила Галина Нещадіна, студентка факультету комп’ютерних наук і технологій.</p><p>12 квітня відбувалися заїзд, реєстрація та поселення учасників: надавалися кімнати у студентських гуртожитках або готелі. Олімпіада проводилась в два етапи: 13 та 14 квітня. В першому етапі в конкурсі взяли участь усі студенти – відбувся письмовий етап. Наступного дня за результатами письмових робіт були визначені фіналісти олімпіади, які в другому етапі змагалися в усній частині. Найбільш обізнані та талановиті посіли призові місця. </p><p>Окрім офіційної частини гості Харкова відвідали Політехнічний музей НТУ «ХПІ» та дізналися багато нового про один з найстаріших технічних вишів України. </p><p>До речі, назва ДонНТУ пролунала під час церемонії нагородження фіналістів олімпіади!</p>',
	'short_text_uk'=>'<p>В олімпіаді прийняли участь 28 студентів із 14 міст України. Донецький національний технічний університет представила Галина Нещадіна, студентка факультету комп’ютерних наук і технологій.</p>',
	'short_text_ru'=>'<p>В олімпіаді прийняли участь 28 студентів із 14 міст України. Донецький національний технічний університет представила Галина Нещадіна, студентка факультету комп’ютерних наук і технологій.</p>',
	'short_text_en'=>'<p>В олімпіаді прийняли участь 28 студентів із 14 міст України. Донецький національний технічний університет представила Галина Нещадіна, студентка факультету комп’ютерних наук і технологій.</p>',
	'images_nums'=>'1,2',
	),$db)){

	$success = false;
}
if(!create_news(array(
	'title_uk'=>'Олімпіада з комп\'ютерної інженерії',
	'title_ru'=>'Олімпіада з комп\'ютерної інженерії',
	'title_en'=>'Олімпіада з комп\'ютерної інженерії',
	'full_text_uk'=>'<p>З 15 по 18 березня на базі Кременчуцького національного університету імені Михайла Остроградського відбувся II тур Всеукраїнської студентської олімпіади за напрямом підготовки «Комп’ютернаінженерія» для спеціальності «Комп’ютерні системи та мережі».</p><p> В олімпіаді взяли участь 34 студента із 12 вищих навчальних закладів України. Наш університет представляли студенти факультету комп’ютерних наук і технологій: Артем Любимов та Ігор Філатов під керівництвом к.т.н., доцента кафедри комп’ютерної інженерії Ковальова С.О. </p><p> За словами учасників від нашого університету, зустріли їх дуже добре, для проживання всім учасникам надали кімнати гуртожитку по 3-4 людини в кімнаті. Сама ж олімпіада проходила 16 березня та тривала чотири години. До речі, незадовго до її початку відбулося загальне зібрання учасників у актовій залі, в ході якого керівництво привітало усіх з прибуттям і побажало успіхів у виконанні завдань. </p><p> За результатами олімпіади наші студенти посіли 7 та 14 місця, що є добрим результатом. А головне – вони набули досвіду і готові передати його наступним учасникам, які, сподіваємось, привезуть призові місця наступного року. Побажаємо успіхів нашим студентам!</p>',
	'full_text_ru'=>'<p>З 15 по 18 березня на базі Кременчуцького національного університету імені Михайла Остроградського відбувся II тур Всеукраїнської студентської олімпіади за напрямом підготовки «Комп’ютернаінженерія» для спеціальності «Комп’ютерні системи та мережі».</p><p> В олімпіаді взяли участь 34 студента із 12 вищих навчальних закладів України. Наш університет представляли студенти факультету комп’ютерних наук і технологій: Артем Любимов та Ігор Філатов під керівництвом к.т.н., доцента кафедри комп’ютерної інженерії Ковальова С.О. </p><p> За словами учасників від нашого університету, зустріли їх дуже добре, для проживання всім учасникам надали кімнати гуртожитку по 3-4 людини в кімнаті. Сама ж олімпіада проходила 16 березня та тривала чотири години. До речі, незадовго до її початку відбулося загальне зібрання учасників у актовій залі, в ході якого керівництво привітало усіх з прибуттям і побажало успіхів у виконанні завдань. </p><p> За результатами олімпіади наші студенти посіли 7 та 14 місця, що є добрим результатом. А головне – вони набули досвіду і готові передати його наступним учасникам, які, сподіваємось, привезуть призові місця наступного року. Побажаємо успіхів нашим студентам!</p>',
	'full_text_en'=>'<p>З 15 по 18 березня на базі Кременчуцького національного університету імені Михайла Остроградського відбувся II тур Всеукраїнської студентської олімпіади за напрямом підготовки «Комп’ютернаінженерія» для спеціальності «Комп’ютерні системи та мережі».</p><p> В олімпіаді взяли участь 34 студента із 12 вищих навчальних закладів України. Наш університет представляли студенти факультету комп’ютерних наук і технологій: Артем Любимов та Ігор Філатов під керівництвом к.т.н., доцента кафедри комп’ютерної інженерії Ковальова С.О. </p><p> За словами учасників від нашого університету, зустріли їх дуже добре, для проживання всім учасникам надали кімнати гуртожитку по 3-4 людини в кімнаті. Сама ж олімпіада проходила 16 березня та тривала чотири години. До речі, незадовго до її початку відбулося загальне зібрання учасників у актовій залі, в ході якого керівництво привітало усіх з прибуттям і побажало успіхів у виконанні завдань. </p><p> За результатами олімпіади наші студенти посіли 7 та 14 місця, що є добрим результатом. А головне – вони набули досвіду і готові передати його наступним учасникам, які, сподіваємось, привезуть призові місця наступного року. Побажаємо успіхів нашим студентам!</p>',
	'short_text_uk'=>'<p>З 15 по 18 березня на базі Кременчуцького національного університету імені Михайла Остроградського відбувся II тур Всеукраїнської студентської олімпіади за напрямом підготовки «Комп’ютернаінженерія» для спеціальності «Комп’ютерні системи та мережі».</p>',
	'short_text_ru'=>'<p>З 15 по 18 березня на базі Кременчуцького національного університету імені Михайла Остроградського відбувся II тур Всеукраїнської студентської олімпіади за напрямом підготовки «Комп’ютернаінженерія» для спеціальності «Комп’ютерні системи та мережі».</p>',
	'short_text_en'=>'<p>З 15 по 18 березня на базі Кременчуцького національного університету імені Михайла Остроградського відбувся II тур Всеукраїнської студентської олімпіади за напрямом підготовки «Комп’ютернаінженерія» для спеціальності «Комп’ютерні системи та мережі».</p>',
	'images_nums'=>'1,2',
	),$db)){

	$success = false;
}

if(!create_news(array(
	'title_uk'=>'Про участь в олімпіаді',
	'title_ru'=>'Про участь в олімпіаді',
	'title_en'=>'Про участь в олімпіаді',
	'full_text_uk'=>'<p>19 квітня 2016 року команда факультету комп\'ютерних наук і технологій ДонНТУ DonNTU_CUBE у складі Костянтина Ольмезова, Івана Верещаги та Артема Любимова (тренер – Оксана Золотухіна) посіла перше місце серед команд Східного регіону (Донецька, Луганська, Харківська області) 1-му етапі Всеукраїнської студентської олімпіади з програмування, що є частиною міжнародних змагань «The ACM-ICPC International Collegiate Programming Contest». Наразі три команди, які приймали участь в попередньому етапі олімпіади готуються до участі наступного етапу олімпіади. Щиро бажаємо успіхів і чекаємо на перемогу!</p>',
	'full_text_ru'=>'<p>19 квітня 2016 року команда факультету комп\'ютерних наук і технологій ДонНТУ DonNTU_CUBE у складі Костянтина Ольмезова, Івана Верещаги та Артема Любимова (тренер – Оксана Золотухіна) посіла перше місце серед команд Східного регіону (Донецька, Луганська, Харківська області) 1-му етапі Всеукраїнської студентської олімпіади з програмування, що є частиною міжнародних змагань «The ACM-ICPC International Collegiate Programming Contest». Наразі три команди, які приймали участь в попередньому етапі олімпіади готуються до участі наступного етапу олімпіади. Щиро бажаємо успіхів і чекаємо на перемогу!</p>',
	'full_text_en'=>'<p>19 квітня 2016 року команда факультету комп\'ютерних наук і технологій ДонНТУ DonNTU_CUBE у складі Костянтина Ольмезова, Івана Верещаги та Артема Любимова (тренер – Оксана Золотухіна) посіла перше місце серед команд Східного регіону (Донецька, Луганська, Харківська області) 1-му етапі Всеукраїнської студентської олімпіади з програмування, що є частиною міжнародних змагань «The ACM-ICPC International Collegiate Programming Contest». Наразі три команди, які приймали участь в попередньому етапі олімпіади готуються до участі наступного етапу олімпіади. Щиро бажаємо успіхів і чекаємо на перемогу!</p>',
	'short_text_uk'=>'<p>19 квітня 2016 року команда факультету комп\'ютерних наук і технологій ДонНТУ DonNTU_CUBE у складі Костянтина Ольмезова, Івана Верещаги та Артема Любимова (тренер – Оксана Золотухіна) посіла перше місце.</p>',
	'short_text_ru'=>'<p>19 квітня 2016 року команда факультету комп\'ютерних наук і технологій ДонНТУ DonNTU_CUBE у складі Костянтина Ольмезова, Івана Верещаги та Артема Любимова (тренер – Оксана Золотухіна) посіла перше місце.</p>',
	'short_text_en'=>'<p>19 квітня 2016 року команда факультету комп\'ютерних наук і технологій ДонНТУ DonNTU_CUBE у складі Костянтина Ольмезова, Івана Верещаги та Артема Любимова (тренер – Оксана Золотухіна) посіла перше місце.</p>',
	'images_nums'=>'1',
	),$db)){

	$success = false;
}

if(!create_news(array(
	'title_uk'=>'Про опонування дисертації',
	'title_ru'=>'Про опонування дисертації',
	'title_en'=>'Про опонування дисертації',
	'full_text_uk'=>'<p>28 квітня 2016 року відбулось засідання спеціалізованої вченої ради К 73.052.04 Черкаського державного технологічного університету, на якій було розглянуто дисертаційну роботу Чикунова Павла Олександровича на здобуття вченого ступеня кандидата технічних наук. Опонентом роботи виступив д.т.н., доцент, зав. кафедри комп\'ютерних наук ДВНЗ "Донецький національний технічний університет" Федоров Євген Євгенович.</p>',
	'full_text_ru'=>'<p>28 квітня 2016 року відбулось засідання спеціалізованої вченої ради К 73.052.04 Черкаського державного технологічного університету, на якій було розглянуто дисертаційну роботу Чикунова Павла Олександровича на здобуття вченого ступеня кандидата технічних наук. Опонентом роботи виступив д.т.н., доцент, зав. кафедри комп\'ютерних наук ДВНЗ "Донецький національний технічний університет" Федоров Євген Євгенович.</p>',
	'full_text_en'=>'<p>28 квітня 2016 року відбулось засідання спеціалізованої вченої ради К 73.052.04 Черкаського державного технологічного університету, на якій було розглянуто дисертаційну роботу Чикунова Павла Олександровича на здобуття вченого ступеня кандидата технічних наук. Опонентом роботи виступив д.т.н., доцент, зав. кафедри комп\'ютерних наук ДВНЗ "Донецький національний технічний університет" Федоров Євген Євгенович.</p>',
	'short_text_uk'=>'<p>28 квітня 2016 року відбулось засідання спеціалізованої вченої ради К 73.052.04 Черкаського державного технологічного університету, на якій було розглянуто дисертаційну роботу Чикунова Павла Олександровича.</p>',
	'short_text_ru'=>'<p>28 квітня 2016 року відбулось засідання спеціалізованої вченої ради К 73.052.04 Черкаського державного технологічного університету, на якій було розглянуто дисертаційну роботу Чикунова Павла Олександровича.</p>',
	'short_text_en'=>'<p>28 квітня 2016 року відбулось засідання спеціалізованої вченої ради К 73.052.04 Черкаського державного технологічного університету, на якій було розглянуто дисертаційну роботу Чикунова Павла Олександровича.</p>',
	'images_nums'=>'1',
	),$db)){

	$success = false;
}

if(!create_news(array(
	'title_uk'=>'Захист бакалаврських робіт 8 червня',
	'title_ru'=>'Захист бакалаврських робіт 8 червня',
	'title_en'=>'Захист бакалаврських робіт 8 червня',
	'full_text_uk'=>'<p>Захист робіт розпочався о 13:00. Членами комісії були: декан факультету Мірошкін Олександр Миколайович, завідувач кафедри Святний Володимир Андрійович, ст. викл. каф. КІ Шевченко Ольга Генадіївна, доцент каф. КІ Шамаєв Віталій Віталійович, доцент каф. КІ Самощенко Олксандр Викторович, доцент каф. КІ Цололо Сергій Олексійович, доцент каф. КІ Ковальов Сергій Олександрович. </p><p>Першою захищалась Волга Анна Олександрівна, темою ії роботи була "Комп\'ютерне розпізнавання новоутворень в легенях за допомогою програмного аналізу результатів рентгену". </p><p>Наступним захищався Гайдук Кирило Сергійович, тема роботи була "Розробка додатка відновлення доступу до зашифрованих даних в ОС Windows".</p><p>Наступним захищався Грабчук Сергій Павлович, тема роботи була "Розробка додатка-довідника за курсом "Комп\'ютерна логіка" для ОС Android".</p><p>Наступним захищався Емексузян Арам Володимирович, тема роботи була "Розробка додатка вибіркової архівації з аналізом вмісту даних".</p><p>Наступним захищався Васильченко Сергій Володимирович, тема роботи була "Розробка комп’ютерної системи керування термодинамічним режимом двигуна внутрішнього згоряння на базі мікроконтролера AtmelATmega32u4".</p><p>Усі студенти вдало захистили свої роботи та отримали високі оцінки від членів комісії та отримали дипломи міжнародного зразка.</p>',
	'full_text_ru'=>'<p><p>Захист робіт розпочався о 13:00. Членами комісії були: декан факультету Мірошкін Олександр Миколайович, завідувач кафедри Святний Володимир Андрійович, ст. викл. каф. КІ Шевченко Ольга Генадіївна, доцент каф. КІ Шамаєв Віталій Віталійович, доцент каф. КІ Самощенко Олксандр Викторович, доцент каф. КІ Цололо Сергій Олексійович, доцент каф. КІ Ковальов Сергій Олександрович. </p><p>Першою захищалась Волга Анна Олександрівна, темою ії роботи була "Комп\'ютерне розпізнавання новоутворень в легенях за допомогою програмного аналізу результатів рентгену". </p><p>Наступним захищався Гайдук Кирило Сергійович, тема роботи була "Розробка додатка відновлення доступу до зашифрованих даних в ОС Windows".</p><p>Наступним захищався Грабчук Сергій Павлович, тема роботи була "Розробка додатка-довідника за курсом "Комп\'ютерна логіка" для ОС Android".</p><p>Наступним захищався Емексузян Арам Володимирович, тема роботи була "Розробка додатка вибіркової архівації з аналізом вмісту даних".</p><p>Наступним захищався Васильченко Сергій Володимирович, тема роботи була "Розробка комп’ютерної системи керування термодинамічним режимом двигуна внутрішнього згоряння на базі мікроконтролера AtmelATmega32u4".</p><p>Усі студенти вдало захистили свої роботи та отримали високі оцінки від членів комісії та отримали дипломи міжнародного зразка.</p></p>',
	'full_text_en'=>'<p><p>Захист робіт розпочався о 13:00. Членами комісії були: декан факультету Мірошкін Олександр Миколайович, завідувач кафедри Святний Володимир Андрійович, ст. викл. каф. КІ Шевченко Ольга Генадіївна, доцент каф. КІ Шамаєв Віталій Віталійович, доцент каф. КІ Самощенко Олксандр Викторович, доцент каф. КІ Цололо Сергій Олексійович, доцент каф. КІ Ковальов Сергій Олександрович. </p><p>Першою захищалась Волга Анна Олександрівна, темою ії роботи була "Комп\'ютерне розпізнавання новоутворень в легенях за допомогою програмного аналізу результатів рентгену". </p><p>Наступним захищався Гайдук Кирило Сергійович, тема роботи була "Розробка додатка відновлення доступу до зашифрованих даних в ОС Windows".</p><p>Наступним захищався Грабчук Сергій Павлович, тема роботи була "Розробка додатка-довідника за курсом "Комп\'ютерна логіка" для ОС Android".</p><p>Наступним захищався Емексузян Арам Володимирович, тема роботи була "Розробка додатка вибіркової архівації з аналізом вмісту даних".</p><p>Наступним захищався Васильченко Сергій Володимирович, тема роботи була "Розробка комп’ютерної системи керування термодинамічним режимом двигуна внутрішнього згоряння на базі мікроконтролера AtmelATmega32u4".</p><p>Усі студенти вдало захистили свої роботи та отримали високі оцінки від членів комісії та отримали дипломи міжнародного зразка.</p></p>',
	'short_text_uk'=>'<p>8 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 5 студентів: Васильченко С.В., Волга А.О., Гайдук К.С., Грабчук С.П., Емексузян А.В.</p>',
	'short_text_ru'=>'<p>8 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 5 студентів: Васильченко С.В., Волга А.О., Гайдук К.С., Грабчук С.П., Емексузян А.В.</p>',
	'short_text_en'=>'<p>8 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 5 студентів: Васильченко С.В., Волга А.О., Гайдук К.С., Грабчук С.П., Емексузян А.В.</p>',
	'images_nums'=>'1,2,3,4,5,6,7,8',
	),$db)){

	$success = false;
}

if(!create_news(array(
	'title_uk'=>'Захист бакалаврських робіт 10 червня',
	'title_ru'=>'Захист бакалаврських робіт 10 червня',
	'title_en'=>'Захист бакалаврських робіт 10 червня',
	'full_text_uk'=>'<p>10 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 8 студентів:  Коваленко О. М., Лаврищев О. В., Любимов А. С., Нестеров А. В., Осадчук О. М.,  Філатов І. А.,  Шендрик М. В.,  Щипанов М. В.</p><p> Захист робіт розпочався о 13:00. Членами комісії були: декан факультету Мірошкін Олександр Миколайович, завідувач кафедри Святний Володимир Андрійович, ст. викл. каф. КІ Шевченко Ольга Генадіївна, доцент каф. КІ Шамаєв Віталій Віталійович, доцент каф. КІ Самощенко Олксандр Викторович, доцент каф. КІ Цололо Сергій Олексійович, доцент каф. КІ Ковальов Сергій Олександрович.</p><p>Першою захищалась Коваленко Олена Михайлівна, темою ії роботи була "Комп\'ютерне розпізнавання новоутворень головного мозку за допомогою програмного аналізу результатів МРТ". </p><p>Наступним захищався Лаврищев Олександр Владиславович, тема роботи була "Розробка додатку для мікроконтролера метеостанції".</p><p>Наступним захищався Любимов Артем Сергійович, тема роботи була "Розробка навчального паралельного MIMD-кластера".</p><p>Наступним захищався Нестеров Антон Володимирович, тема роботи була "Розробка веб-додатка обліку об\'єктів зовнішньої реклами".</p><p>Наступним захищався Осадчук Олексій Миколайович, тема роботи була "Розробка редактора даних конфігурації завантаження ОС".</p><p>Наступним захищався Філатов Ігор Анатолійович, тема роботи була "Розробка додатка-довідника мережевого адміністратора для ОС Android".</p><p>Наступним захищався Шендрик Максим Вікторович, тема роботи була "Розробка кросплатформенного додатка створення кросвордів на Java FX".</p><p>Останнім захищався Щипанов Максим Віталійович, тема роботи була "Розробка програмного модулю первинної обробки даних для комп’ютерної інформаційної системи".</p><p>Усі студенти вдало захистили свої роботи та отримали високі оцінки від членів комісії та отримали дипломи міжнародного зразка.</p><p>Після цього офіційна частина закінчилась та кафедрі було вручено подарунок від групи.</p>',
	'full_text_ru'=>'<p>10 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 8 студентів:  Коваленко О. М., Лаврищев О. В., Любимов А. С., Нестеров А. В., Осадчук О. М.,  Філатов І. А.,  Шендрик М. В.,  Щипанов М. В.</p><p> Захист робіт розпочався о 13:00. Членами комісії були: декан факультету Мірошкін Олександр Миколайович, завідувач кафедри Святний Володимир Андрійович, ст. викл. каф. КІ Шевченко Ольга Генадіївна, доцент каф. КІ Шамаєв Віталій Віталійович, доцент каф. КІ Самощенко Олксандр Викторович, доцент каф. КІ Цололо Сергій Олексійович, доцент каф. КІ Ковальов Сергій Олександрович.</p><p>Першою захищалась Коваленко Олена Михайлівна, темою ії роботи була "Комп\'ютерне розпізнавання новоутворень головного мозку за допомогою програмного аналізу результатів МРТ". </p><p>Наступним захищався Лаврищев Олександр Владиславович, тема роботи була "Розробка додатку для мікроконтролера метеостанції".</p><p>Наступним захищався Любимов Артем Сергійович, тема роботи була "Розробка навчального паралельного MIMD-кластера".</p><p>Наступним захищався Нестеров Антон Володимирович, тема роботи була "Розробка веб-додатка обліку об\'єктів зовнішньої реклами".</p><p>Наступним захищався Осадчук Олексій Миколайович, тема роботи була "Розробка редактора даних конфігурації завантаження ОС".</p><p>Наступним захищався Філатов Ігор Анатолійович, тема роботи була "Розробка додатка-довідника мережевого адміністратора для ОС Android".</p><p>Наступним захищався Шендрик Максим Вікторович, тема роботи була "Розробка кросплатформенного додатка створення кросвордів на Java FX".</p><p>Останнім захищався Щипанов Максим Віталійович, тема роботи була "Розробка програмного модулю первинної обробки даних для комп’ютерної інформаційної системи".</p><p>Усі студенти вдало захистили свої роботи та отримали високі оцінки від членів комісії та отримали дипломи міжнародного зразка.</p><p>Після цього офіційна частина закінчилась та кафедрі було вручено подарунок від групи.</p>',
	'full_text_en'=>'<p>10 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 8 студентів:  Коваленко О. М., Лаврищев О. В., Любимов А. С., Нестеров А. В., Осадчук О. М.,  Філатов І. А.,  Шендрик М. В.,  Щипанов М. В.</p><p> Захист робіт розпочався о 13:00. Членами комісії були: декан факультету Мірошкін Олександр Миколайович, завідувач кафедри Святний Володимир Андрійович, ст. викл. каф. КІ Шевченко Ольга Генадіївна, доцент каф. КІ Шамаєв Віталій Віталійович, доцент каф. КІ Самощенко Олксандр Викторович, доцент каф. КІ Цололо Сергій Олексійович, доцент каф. КІ Ковальов Сергій Олександрович.</p><p>Першою захищалась Коваленко Олена Михайлівна, темою ії роботи була "Комп\'ютерне розпізнавання новоутворень головного мозку за допомогою програмного аналізу результатів МРТ". </p><p>Наступним захищався Лаврищев Олександр Владиславович, тема роботи була "Розробка додатку для мікроконтролера метеостанції".</p><p>Наступним захищався Любимов Артем Сергійович, тема роботи була "Розробка навчального паралельного MIMD-кластера".</p><p>Наступним захищався Нестеров Антон Володимирович, тема роботи була "Розробка веб-додатка обліку об\'єктів зовнішньої реклами".</p><p>Наступним захищався Осадчук Олексій Миколайович, тема роботи була "Розробка редактора даних конфігурації завантаження ОС".</p><p>Наступним захищався Філатов Ігор Анатолійович, тема роботи була "Розробка додатка-довідника мережевого адміністратора для ОС Android".</p><p>Наступним захищався Шендрик Максим Вікторович, тема роботи була "Розробка кросплатформенного додатка створення кросвордів на Java FX".</p><p>Останнім захищався Щипанов Максим Віталійович, тема роботи була "Розробка програмного модулю первинної обробки даних для комп’ютерної інформаційної системи".</p><p>Усі студенти вдало захистили свої роботи та отримали високі оцінки від членів комісії та отримали дипломи міжнародного зразка.</p><p>Після цього офіційна частина закінчилась та кафедрі було вручено подарунок від групи.</p>',
	'short_text_uk'=>'<p>10 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 8 студентів:  Коваленко О. М., Лаврищев О. В., Любимов А. С., Нестеров А. В., Осадчук О. М.,  Філатов І. А.,  Шендрик М. В.,  Щипанов М. В.</p>',
	'short_text_ru'=>'<p>10 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 8 студентів:  Коваленко О. М., Лаврищев О. В., Любимов А. С., Нестеров А. В., Осадчук О. М.,  Філатов І. А.,  Шендрик М. В.,  Щипанов М. В.</p>',
	'short_text_en'=>'<p>10 червня відбувся захист кваліфікаційних робіт бакалаврів в групі КІ-12. У цей день захищались 8 студентів:  Коваленко О. М., Лаврищев О. В., Любимов А. С., Нестеров А. В., Осадчук О. М.,  Філатов І. А.,  Шендрик М. В.,  Щипанов М. В.</p>',
	'images_nums'=>'1,2,3,4,5,6,7',
	),$db)){

	$success = false;
}

if(!create_news(array( 'title_uk'=>'ШАНОВНІ АБІТУРІЄНТИ ТА БАТЬКИ!','title_ru'=>'ШАНОВНІ АБІТУРІЄНТИ ТА БАТЬКИ!','title_en'=>'ШАНОВНІ АБІТУРІЄНТИ ТА БАТЬКИ!', 'full_text_uk'=>'<p>ДВНЗ "Донецький національний технічний університет" (м. Покровськ) ЗАПРОШУЄ вас відвідати ДЕНЬ ВІДКРИТИХ ДВЕРЕЙ, який відбудеться 25 БЕРЕЗНЯ 2017 р. о 13.00. У програмі: </p><ul><li>роз\'яснення щодо вступної кампанії-2017;</li><li>презентація Університету (Університет очима студентів, можливості, які відкриває ДонНТУ та ін.); </li><li>презентація заходів під назвою "Сучасна наука в дії"; </li><li>підведення підсумків та нагородження учасників Всеукраїнської олімпіади - 2017. </li></ul></p><p>АДРЕСА ПРОВЕДЕННЯ І КОНТАКТИ: м. Покровськ (Красноармійськ), пл. Шибанкова, 2, тел.: (06239)2-51-99, 066-185-74-31, 093-049-69-89</p><p>Зустрічаємо в холі 1-го корпусу. </p><p>ЧЕКАЄМО НА ВАС!</p>',
	'full_text_ru'=>'<p>ДВНЗ "Донецький національний технічний університет" (м. Покровськ) ЗАПРОШУЄ вас відвідати ДЕНЬ ВІДКРИТИХ ДВЕРЕЙ, який відбудеться 25 БЕРЕЗНЯ 2017 р. о 13.00. У програмі: </p><ul><li>роз\'яснення щодо вступної кампанії-2017;</li><li>презентація Університету (Університет очима студентів, можливості, які відкриває ДонНТУ та ін.); </li><li>презентація заходів під назвою "Сучасна наука в дії"; </li><li>підведення підсумків та нагородження учасників Всеукраїнської олімпіади - 2017. </li></ul></p><p>АДРЕСА ПРОВЕДЕННЯ І КОНТАКТИ: м. Покровськ (Красноармійськ), пл. Шибанкова, 2, тел.: (06239)2-51-99, 066-185-74-31, 093-049-69-89</p><p>Зустрічаємо в холі 1-го корпусу. </p><p>ЧЕКАЄМО НА ВАС!</p>',
	'full_text_en'=>'<p>ДВНЗ "Донецький національний технічний університет" (м. Покровськ) ЗАПРОШУЄ вас відвідати ДЕНЬ ВІДКРИТИХ ДВЕРЕЙ, який відбудеться 25 БЕРЕЗНЯ 2017 р. о 13.00. У програмі: </p><ul><li>роз\'яснення щодо вступної кампанії-2017;</li><li>презентація Університету (Університет очима студентів, можливості, які відкриває ДонНТУ та ін.); </li><li>презентація заходів під назвою "Сучасна наука в дії"; </li><li>підведення підсумків та нагородження учасників Всеукраїнської олімпіади - 2017. </li></ul></p><p>АДРЕСА ПРОВЕДЕННЯ І КОНТАКТИ: м. Покровськ (Красноармійськ), пл. Шибанкова, 2, тел.: (06239)2-51-99, 066-185-74-31, 093-049-69-89</p><p>Зустрічаємо в холі 1-го корпусу. </p><p>ЧЕКАЄМО НА ВАС!</p>',
	'short_text_uk'=>'<p>ДВНЗ "Донецький національний технічний університет" (м. Покровськ) ЗАПРОШУЄ вас відвідати ДЕНЬ ВІДКРИТИХ ДВЕРЕЙ, який відбудеться 25 БЕРЕЗНЯ 2017 р. о 13.00. У програмі: </p><ul><li>роз\'яснення щодо вступної кампанії-2017;</li><li>презентація Університету (Університет очима студентів, можливості, які відкриває ДонНТУ та ін.); </li><li>презентація заходів під назвою "Сучасна наука в дії"; </li><li>підведення підсумків та нагородження учасників Всеукраїнської олімпіади - 2017. </li></ul></p><p>АДРЕСА ПРОВЕДЕННЯ І КОНТАКТИ: м. Покровськ (Красноармійськ), пл. Шибанкова, 2, тел.: (06239)2-51-99, 066-185-74-31, 093-049-69-89</p><p>Зустрічаємо в холі 1-го корпусу. </p><p>ЧЕКАЄМО НА ВАС!</p>',
	'short_text_ru'=>'<p>ДВНЗ "Донецький національний технічний університет" (м. Покровськ) ЗАПРОШУЄ вас відвідати ДЕНЬ ВІДКРИТИХ ДВЕРЕЙ, який відбудеться 25 БЕРЕЗНЯ 2017 р. о 13.00. У програмі: </p><ul><li>роз\'яснення щодо вступної кампанії-2017;</li><li>презентація Університету (Університет очима студентів, можливості, які відкриває ДонНТУ та ін.); </li><li>презентація заходів під назвою "Сучасна наука в дії"; </li><li>підведення підсумків та нагородження учасників Всеукраїнської олімпіади - 2017. </li></ul></p><p>АДРЕСА ПРОВЕДЕННЯ І КОНТАКТИ: м. Покровськ (Красноармійськ), пл. Шибанкова, 2, тел.: (06239)2-51-99, 066-185-74-31, 093-049-69-89</p><p>Зустрічаємо в холі 1-го корпусу. </p><p>ЧЕКАЄМО НА ВАС!</p>',
	'short_text_en'=>'<p>ДВНЗ "Донецький національний технічний університет" (м. Покровськ) ЗАПРОШУЄ вас відвідати ДЕНЬ ВІДКРИТИХ ДВЕРЕЙ, який відбудеться 25 БЕРЕЗНЯ 2017 р. о 13.00. У програмі: </p><ul><li>роз\'яснення щодо вступної кампанії-2017;</li><li>презентація Університету (Університет очима студентів, можливості, які відкриває ДонНТУ та ін.); </li><li>презентація заходів під назвою "Сучасна наука в дії"; </li><li>підведення підсумків та нагородження учасників Всеукраїнської олімпіади - 2017. </li></ul></p><p>АДРЕСА ПРОВЕДЕННЯ І КОНТАКТИ: м. Покровськ (Красноармійськ), пл. Шибанкова, 2, тел.: (06239)2-51-99, 066-185-74-31, 093-049-69-89</p><p>Зустрічаємо в холі 1-го корпусу. </p><p>ЧЕКАЄМО НА ВАС!</p>',
	'images_nums'=>'1',
	),$db)){

	$success = false;
}


if($success){
	echo "<p>Your database was successfully installed!</p>";
}



?>

